backend/app/controllers/api/users/profiles_controller.rb

UPDATE "users" SET "contact_number" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["contact_number", "987654321"], ["updated_at", "2025-05-09 13:57:34.048363"], ["id", 127]]
---
  def update
    if @current_user.update(profile_params)