backend/app/controllers/api/auth_controller.rb

INSERT INTO "users" ("name", "email", "contact_number", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def register
    @user = User.new(user_params)

    if @user.save